package com.test.java; //03.04

//수업 때 필기는 따로하지 말고 주석으로 ^^ Comment, Remark

/*
 주석은 컴파일러가 번역하지 않는다.
 -프로그래밍 코드는 아니지만, 코드에 기억해야할 내용을 작성한다.
 -코드 설명, 나중에 확인, 전달 설명, 여러가지 요소 기재
 -사람을 위한 공간(포스트잇)
 -수업 필기용
 
 */

//클래스, class '{'~'}'가 한 세트. 자바는 공백문자에 자유로운 언어(키워드와 키워드 사이 공백 okay)
// - public class Ex01 > 클레스 선언부(header)
// = {} > 클래스 구현부(body)

//"Ex01이라는 이름을 가진 클래스입니다." (코드를 짜는 것도 중요하지만 코드를 읽을 줄도 알아야함.) / 말로 표현하는 연습도 해야해.


public class Ex01 {   

	//메소드, method
	//- 코드의 집합
	
	//"main이라는 이름을 가진 메소드입니다."
	public static void main(String[] args) {
	
		//명령어 > 문장 단위로 구성되어있음
		
		//문장(Statement)
		//';'(세미콜론) : 문장의 끝을 알리는 마침표(문장 종결자)
		
		System.out.println("예제");
		
		// 이클립스 <-> 실시간으로 검사받음 <-> javac.exe (문법 체크하는 기능)
		// 컴파일러는 조금의 오류라도 있으면 전체 번역을 취소함(100%로 완전할 때만 번역함)
		
		/*
		 
		코드작성
		- 영문자
		- 숫자
		- 한글
		- 특수문자
		
		~(tilde), !, @, #(샵,해쉬), $(달라), %(퍼센트), ^(xor, caret), &(앰퍼샌드),
		 *, `(역따옴표, back tick, back quote), ', ", -(마이너스 기호,하이픈,dash),
		_(밑줄, 언더라인), |(vertical bar, pipe), ?(quesion mark, 물음표), /(슬래쉬,slash), \(back slash, 역슬래쉬)
		
		(영문으로 찾아봐 특수문자) https://agibbyeongari.tistory.com/865
		
		() : 소괄호
		{} : 중괄호
		[] : 대괄호
		<> : 화살표 괄호
		
		
		A > B  : A greater than B
		A >= B : A greater than equals B
		
		이런 식으로 영문 독해가 필요할 때가 많으니 독해력도.. 
		(회사가서 PT할때 영단어나 전문용어를 쓰면 좀 더 설득력이 ㅋ.. 알아듣든 말든 영어 섞어서 해야 직빵 ㅋ)
		
		 */
		
	}
}








