package com.test.java; //03.11


//클래스명에 따로 의미를 두지 않음.
//지금 이해가 안가거나 나중에 수업한다고 해서 정리를 미룬 내용들.
//이해가 가는 rework에
//나중에 할건 따로. 우선 본 수업 내용에 표시.
//TODO표시도 하고, 서머리에 정리까지 했으면 -> 어느정도 완벽하게 이해한 정도로 공부했다는거니까.
//이걸 하고도 그 파일을 열어서 또 공부를 하면 이 행위는 의미가 없음.
//완벽하게 공부했을때만 서머리에 옮겨
//주말에 이 작업하자! 
//1. 다시는 안봐도 될 것 > 완벽 이해 + 정리
//2. 다시 봐야 될 것 > Rework에 옮겨
//3. 나중에 추가로 정리할 것 (추가로 봐야할 것) > TODO표시



public class Item01 {

	public static void main(String[] args) {
		
		//[SUMMARY]	변수 만들기
		
		int num;	//변수 생성 > 자료형 변수명
		
		num = 100;	//변수 초기화
		
		
		//이건 실행시키려고 만든 프로그램이 아니라, 나중에 기억이 안날 때 간단히 볼 수 있는 핵심코드 요약본을 만든것. (기본문법)
		
		
	}
}
